{
    "name": "Aviation and Rocketry",
    "email": "cupertinoarc@gmail.com",
    "category": "stem & tech",
    "meeting_time": "afterschool weekly, still finalizing day",
    "description": "",
    "affiliation": "N/A",
    "advisor_name": "Mr. Steemers",
    "advisor_email": "hugo_steemers@fuhsd.org",
    "advisor_room": "506",
    "officers": "Kai Wang, kwang332, President, Leads the club and the officer team. Representative of the club in front of ASB\nand the student body.\nMero Elmarassy, aelmarassy355, Vice President, Assist President in leading the club. Check club-related emails.\nCommunication between club advisor and club officers.\nRiya Panche, rpanche700, Secretary, Create meeting minutes and record attendance. Take care of club rosters\nand club member information.\nSashank lyer, siyer865, Treasurer, Maintain financial data, and money collected and spent by the club.\nHenry Widjaja, hwidjaja801g, PR, Communication between club officers and club members as well as the\ncontact point for outside organizations. Promotion of the club.",
    "adjustment_policy": "We anticipate that officer positions won't change during the year. If an officer needs to step down, we will do an abbreviated officer selection process with a shorter timeline to find a replacement. This process would include a written application where the applicant will tell us about relevant experience, time commitment, and what makes them the best officer for the role. Then, we will have the majority of the officer team (all members if possible) interview each individual applicant. We would then select a new officer, check with our advisor, then notify ASB of the change.",
    "new_officer_application": "Awritten application should be filled out by interested club members to move on to the next round. Our application is open to all members of the club. Selected candidates from the first round will do an interview with current officers to understand each person on an individual level. Based on the interview and written application, the officers will select the new officer team. Current officers do not need to re-apply to their positions."
}