{
    "name": "CHS Anti-Racism Taskforce",
    "email": "chsantiracismtaskforce@gmail.com",
    "category": "culture (or activist society)",
    "meeting_time": "every other Thursday at lunch",
    "description": "",
    "affiliation": "n/a",
    "advisor_name": "Julia Roberts",
    "advisor_email": "Julia_Roberts@fuhsd.org",
    "advisor_room": "6232",
    "officers": "Gauri Chawla, gchawla327, President\nAs president, they will be responsible for coordinating all meetings with outside organizations (student unions,\ncommunity organizations, etc.) Moreover, they will create meeting slides + plans as well as work with the\nsecretary regarding meeting post details. They will be responsible for overall communication (via both their\npersonal and club email account) as well as organization in committing to and carrying out action items that are\ndescribed in the club calendar.\nJenny Chen, ychen361, Vice President\nAs vice president, they will be working closely with the president to coordinate all meetings (this includes making\nslides, coming up with meeting plans, making sure all links work, etc). This includes member and officer meetings,\nbut also meetings with departments and administrators depending on our action plan for the year. They will also\nbe responsible for coming up with projects with specific timelines for the 2022-2023 school year, alongside the\npresident.\nSara Winebarger, swinebarger428, Secretary/Treasurer\nAs secretary, they will be responsible for recording all meeting minutes and working closely with the vice\npresident. They will also coordinate with the president regarding posts that need to be made for our club. As\ntreasurer, they will be responsible for maintaining our financial account (knowing the balance, tracking what we\nuse it for, suggesting ways to use our finances, etc). Additionally, if we are planning to do guest speakers, they will\nbe responsible for maintaining our budget for them.",
    "adjustment_policy": "application + interview process, supervised by president",
    "new_officer_application": "application + interview process, supervised by president"
}