{
    "name": "Cupertino JTASA",
    "email": "cupertinojtasa@gmail.com",
    "category": "culture & ethnicities",
    "meeting_time": "Friday at Lunch",
    "description": "",
    "affiliation": "Junior Taiwanese American Student Association (JTASA)",
    "advisor_name": "Mr. Tsai",
    "advisor_email": "norman_tsai@fuhsd.org",
    "advisor_room": "6221",
    "officers": "1. Kristine Huang, shuang547, President\n- leads and calls officer meetings and member meetings\n- delegates officer tasks\n- set a plan for the goals/topics of each meeting\n- communicates to asb and represents club\n2. Wendy Chung, schung120, Vice President\n- communicates with club officers and the club advisor\n- manages the club email\n- assists the president, acts as president if president is absent\n3. Jenny Chen, ychen361, Secretary\n- takes meeting minutes for all member/officer meetings\n- in charge of attendance (making google form to keep track of emails, people, date of meetings)\n- keeps track of club schedule for each meeting\n4. Carrie Chen, cchen759, Treasurer\n- records financial transactions (both receipts and disbursements)\n- records how much money collected and spent for both profits and losses\n- in charge of filling out fundraiser paperwork\n5. Andrea Lo, alo296, Public Relations\n- creates drafts of emails to remind members of meetings\n- updates social media (instagram) so members are aware of meetings\n- communicates with club members about logistics (room, date, the topic of that specific meeting)",
    "adjustment_policy": "During the year, if adjustments are necessary, we will first notify our advisor. If the adjustment is President, VP, Secretary, or Treasurer, we will contact the club commissioners (tinoclubs@gmail.com). The rest of the officer team will try to fill the position with an existing officer. However, if that is not possible, we will recruit a new candidate (through a written application).",
    "new_officer_application": "Next year, the graduating officers will send out a google form to the club members with a written application, with questions such as their applied positions, commitment to the club, future ideas, etc. The returning officers will also have to fill the written application out. The graduating officers will review the written applications and select the officers for next year with the approval of our advisor."
}