{
    "name": "Cupertino National Honor Society",
    "email": "info.tinonhs@gmail.com",
    "category": "volunteering & honor societies",
    "meeting_time": "Monthly, Friday at lunch",
    "description": "",
    "affiliation": "National Honor Society",
    "advisor_name": "Kent Paris",
    "advisor_email": "kent_paris@fuhsd.org",
    "advisor_room": "507",
    "officers": "Datta Kansal, dkansal036, Co-President, Work together with the other Co-President and Vice-President to lead\nthe officer team. Focus on expanding the club and increasing member involvement in events.\nCaroline Cheng, ccheng411, Co-President, Work together with the other Co-President and Vice-President to\nlead the officer team. Focus on expanding the club and increasing member involvement in events.\nKatelyn Chu, kchu067, Vice-President, Work together with the other Co-Presidents to lead the officer team.\nFocus on expanding the club and increasing member involvement in events.\nBaran Abbasi, babbasi698, Secretary / Webmaster. Ensure finance decisions and meeting notes are submitted\nto ASB. Send out meeting recaps, reminders to members.\nJimin Koo, jkoo555, Treasurer, Work on finding creative ways to fundraise money to secure the $385 annual\nNHS membership fee.\nPrathan Ghosh, pghosh700, Event Manager, Work on finding new events in a variety of different areas. Gather\nmember input on new events and improve older events.\nYash Agarwal, yagarwal028, Event Manager, Work on finding new events in a variety of different areas. Gather\nmember input on new events and improve older events.\nTiffany Hu, thu867, Event Manager, Work on finding new events in a variety of different areas. Gather member\ninput on new events and improve older events.\nAshwin Kumar, akumar733, Event Manager, Work on finding new events in a variety of different areas. Gather\nmember input on new events and improve older events.\nRiya Malik, rmalik881, Public Relations, Increase member engagement on social media by posting videos,\nphotos, and graphics about new events and meetings.\nSierra Chen, schen356, Public Relations, Increase member engagement on social media by posting videos,\nphotos, and graphics about new events and meetings.",
    "adjustment_policy": "The exec team (Co-Presidents and Vice-President) will first have a talk about their unproductivity. After noticing their productivity for the next 2 weeks, exec will decide whether further actions should be taken and if Mr. Paris should be contacted.",
    "new_officer_application": "The current exec team interviews junior officers who are interested in applying to next year's exec team. After the new exec team is selected, they will interview new applicants and select those they deem fit for the role(s). Old exec will give their input on the decisions and then the selected officers will be notified."
}