{
    "name": "Cupertino ASL Club",
    "email": "cupertinoasi@gmail.com",
    "category": "other",
    "meeting_time": "every Friday at lunch",
    "description": "",
    "affiliation": "Not Applicable",
    "advisor_name": "Julia Roberts",
    "advisor_email": "julia_roberts@fuhsd.org",
    "advisor_room": "6232",
    "officers": "Siyona Sarma, ssarma634, President, Lead the club and the club officer team, Represent the club to ASB and the\nTino Student Body, Initiate and preside over club officer and member meetings, Call special meetings, if\nnecessary, Plan and prepare an agenda for all meetings, Comfortably converses in ASL\nAmber Yao, ayao366, Vice President, Serve as the liaison between the club officers and the club advisor, Be the\nwatcher of the club email, Assist the president in planning and execution, Serve as the president if the president\nbecomes unable to fulfill their duties. Communicate with the advisor, manage fundraising or events like Deaf Chat\nJinjeong Kim, jkim606, Secretary, Create and maintain meeting agendas (see Meetings for more information),\nTake attendance at meetings, and keep permanent attendance records., Maintain contact names, addresses,\nphone numbers, and email addresses of club members, Keep copies of activity calendars and special events\ndocuments,\nNatalie Chen, nchen286, Treasurer, Maintain a complete and accurate record of all financial transactions,\nincluding receipts and disbursements, Keep accurate profit and loss statements, clearly detailing all money\ncollected and spent, and help the club keep accurate records, Initiative, and fill out fundraiser paperwork (see\nFinance for more information)\nCelina Yang, cyang508, Public Relations, Handles media and comes up with ideas for fundraising\nSophie Yang, syang407, Public Outreach, Handles club partnerships (like with Best Buddies or with the Art\nClub), and inter-school relations\nAnav Saxena, asaxena954, Apprentice, Learns key officer roles because 5 of the other officers are current\nseniors so we would like to have two people we can rely on to pass the club to.",
    "adjustment_policy": "Last year, one of our officers moved away, and we were able to adapt our positions to take on the role that they did. Most of our roles are pretty flexible so if an officer happens to step down during the year, Anav would take their position.",
    "new_officer_application": "We generally start out by sending out a Google Form which key questions that we expect officer prospects to answer appropriately. If the number of applicants exceeds more than 10, we will hold in-person or Zoom interviews to get a sense of their personality since a lot of our club is based on teaching."
}