{
    "name": "Cupertino Mock Trial",
    "email": "cupertinomocktrial@gmail.com",
    "category": "other",
    "meeting_time": "every Tuesday from 6-8 pm",
    "description": "",
    "affiliation": "Santa Clara County Office of Education Constitutional Rights Foundation",
    "advisor_name": "Sean Bui",
    "advisor_email": "sean_bui@fuhsd.org",
    "advisor_room": "108",
    "officers": "Aadith Kannan, akannan603, Co-President, plans & leads club meetings & pre-trial subdivision of the club, plans\nhigh-level logistics (scrimmages, competitions, etc.)\nSrinidhi Nagarajan, snagarajan520, Co-President, plans & leads club meetings & defense subdivision of the\nclub, plans high-level logistics (scrimmages, competitions, etc.)\nAdhya Krishnamurthy, akrishnamurthy714, Vice President, shares the responsibility of planning the meetings and\ncoordinating details with coaches and the presidents.\nYeonwoo Lee, ylee953, Treasurer, takes care of the team’s finances and plans and executes the apparel\nprocess\nShravani Venkatesh, svenkatesh336, Secretary, main responsibility is to take care of meeting minutes and\nattendance.\nSanskriti Jain, sjain940, Public Relations, take care of the mock trial social media accounts and post occasional\ngraphics, pictures, etc. (graphic design skills would be very useful for this)",
    "adjustment_policy": "Officers will be expected to take on general leadership duties when necessary, including general meeting planning, competitions/scrimmage planning, and facilitation of intra-team morale & spirit. Additionally, officers that fail to meet their expectations will be asked to step down, with new officers selected via an application process conducted by the remaining officers.",
    "new_officer_application": "President(s) will be appointed by this year's current co-presidents. The appointed President(s) will conduct an application process (with a written application and interviews) to select their officer team, including their Vice President(s), Treasurer, Secretary, and Public Relations officer."
}