{
    "name": "Cupertino Gender Sexuality Alliance",
    "email": "cupertinohs.gsa@gmail.com",
    "category": "other",
    "meeting_time": "Mondays at Lunch",
    "description": "",
    "affiliation": "No",
    "advisor_name": "Jenna Ray, Esther Hsu",
    "advisor_email": "jenna_ray/esther_hsu@fuhsd.org",
    "advisor_room": "213",
    "officers": "Pragya Natarajan, pnatarajan354, co-president, lead club meetings and projects, talk with admin and other clubs\nVarsha Vijay, vvijay850, co-president, lead club meetings and projects, talk with admin and other clubs\nLaurance Shipley, Ishipley090, vice president, assist co-presidents and help introduce club activities to club\nmembers. Also keeps documents of passwords and accounts and takes care of conflict resolution.\nXinpei Lu, xlu926, secretary, Write club meeting minutes and submit meeting minutes to ASB.\nTake notes during officer meetings, organize writing new club bylaws, taking pictures of notes written on the\nwhite board during meetings (to save for future meetings).\nSophie Yang, syang407, treasurer, handle club expenditure and transactions and work with event coordinators\nto cover costs for events.\nEmily Sandrini, esandrini928, public relations officer, makes flyers and instagram posts\nKatie Lee, klee184, Fundraising Chair, comes up with ideas for fundraising and helps organize fundraisers and\nmanage fundraisers throughout the year.\nAnav Saxena, asaxena954, Fundraising Chair, comes up with ideas for fundraising and helps organize and\nmanage fundraisers throughout the year.\nAditi Ghosh, aghosh647, Event Coordinator, comes up with ideas for club events and organizes details\nAngelina Kim, akim081, Event Coordinator, organize and manage events throughout the year\nZac Oelke, zoelke662, Discord moderator, monitor chat activity and delete material which goes against club\nrules as well as start the conflict resolution process.\nMichelle Choi, mchoi391, Discord moderator, monitor chat activity and delete material which goes against club\nrules as well as start the conflict resolution process.\nHritvik Shrivastava, hshrivastava025, Discord moderator, monitor chat activity and delete material which goes\nagainst club rules as well as start the conflict resolution process.",
    "adjustment_policy": "We have decided to have a large officer team with an Exec officer team and an overall officer team. This is because GSA has had a high rate of officers who are no longer able to fulfill their positions because of the nature of the club, so we can adjust the officer team however necessary. Event coordinators, fundraising chairs, and discord moderators will all be able to fill the roles of officers that can no longer be part of the Exec team which consists of the co-presidents, vice president, secretary, public relations officer, and treasurer.",
    "new_officer_application": "New officers for next year will be selected through opening officer applications, which will be deliberated on amongst the officer team."
}