{
    "name": "Cupertino Environmental Club",
    "email": "cupertinoenvironmentalclub@gmail.com",
    "category": "volunteering & honor societies",
    "meeting_time": "Every other Wednesday at lunch",
    "description": "",
    "affiliation": "N/A",
    "advisor_name": "Andrew Goldenkranz",
    "advisor_email": "andrew_goldenkranz@fuhsd.org",
    "advisor_room": "7103",
    "officers": "Aaditya Karnataki, akarnataki027, President, Lead/represent the club and make decisions on club activities.\nXinpei Lu, xlu926, Vice President, Assist the President, handle the club email, and serve as president if the\npresident is unable to.\nLara Gupta, Igupta613, Secretary, keep track of members and meeting minutes.\nTejal Bavadekar, tbavadekar174, Treasurer, Handle finances/reimbursements and keep record of all financial\ntransactions.\nErinn Huang, ehuang874, PR/Communications Officer, Handle social media and all communication, including\nboth inside and outside the club.",
    "adjustment_policy": "If the president is unable to fulfill his role, the Vice President shall replace him. The open position of Vice President shall be filled with another current officer, and the resulting open position shall be filled by either merging the roles of Secretary and treasurer or by selecting a qualified member. If the Vice President is unable to fulfill her role, the open position of Vice President shall be filled with another current officer, and the resulting open position shall be filled by either merging the roles of Secretary and treasurer or by selecting a qualified member. If any one of the Secretary, Treasurer, or PR/Communications Officers are unable to fulfill their roles, the open position shall be filled by either merging the roles of Secretary and Treasurer or by selecting a qualified member.",
    "new_officer_application": "Current officers will keep their roles for next year. If necessary, new officers for next year shall be selected by application and selection by the current officer team."
}