{
    "name": "Cupertino Robotics",
    "email": "cupertinorobotics@gmail.com",
    "category": "stem & tech",
    "meeting_time": "Monthly, Friday at lunch",
    "description": "",
    "affiliation": "Cupertino Robotics",
    "advisor_name": "Hugo Steemers",
    "advisor_email": "hugo_steemers@fuhsd.org",
    "advisor_room": "506",
    "officers": "Datta Kansal, dkansal036@student.fuhsd.org, President, Lead the officer team and all the divisions Cupertino\nRobotics covers. Be a contact point between ASB, Club, and FIRST robotics teams in Cupertino Robotics Inc.\nFocus on increasing Cupertino robotics impact in the community and improving member engagement amongst the\ndifferent divisions.\nMayand Gulati, mgulati616@student.fuhsd.org, Vice-President, Help lead and bridge the gap between all the\ndivisions of Cupertino Robotics. Continue to keep Cupertino Robotics an integral part of the FUHSD robotics\ncollective. Focus on easing the transition from one robotics division to another and provide support to each\ndivision.\nNavyaa Guptaa, ngupta914@student.fuhsd.org, Outreach Lead, Oversee/help coordinate outreach events held\nby robotics teams and ensure detailed documentation of each event.\nAllison Yu, ayu532@student.fuhsd.org, Outreach Lead, Oversee/help coordinate outreach events held by\nrobotics teams and ensure detailed documentation of each event.\nAkshat Mehta, amehta639@student.fuhsd.org, Sponsorship Lead / Treasurer, Find new grants and contact\nvarious companies to find new areas of revenue for our FIRST robotics teams. Communicate with ASB all\nfinancial decisions and spending.\nMaisha Gupta, mgupta767@student.fuhsd.org, Web Lead / Secretary, Maintain and update the website including\nimages, news, blog posts, FAQ, team pages, and more. Communicate with officers to get feedback and update\nthe website consistently. Take meeting notes at officer and club meetings to submit to ASB.\nIshani Das, idas665@student.fuhsd.org, Public Relations Lead, Manage social media presence on Instagram\nand Facebook by creating promotional graphics/videos. Organize annual club apparel.\nKayal Murugesan, kmurugesan575@student.fuhsd.org, Meeting Organizer), Plan effective meetings that are well\nthought out and rehearsed. Responsible for club-wide social events such as the winter social and other bonding\nevents Collect feedback and suggestions from members on future meetings",
    "adjustment_policy": "Officers were chosen after feedback from mentors, and through the personal experience of officers working with them in FIRST Robotics teams. In the unlikely event of an officer being adjusted, the President and Vice-President will have a talk with the officer about their performance, and if the issue is still not solved then we will speak with our advisor, Mr. Steemers, about further actions to be taken.",
    "new_officer_application": "The President usually selects the next year's President. After creating an officer application form, the current president, next year's President, and our mentor, Mr. Williams works together to find valuable new additions to the new officer team."
}