{
    "name": "FBLA",
    "email": "tino.fbla@gmail.com",
    "category": "business & politics",
    "meeting_time": "every Thursday at lunch",
    "description": "",
    "affiliation": "FBLA Phi Beta Lambda",
    "advisor_name": "Aiden Hill",
    "advisor_email": "aiden_hill@fuhsd.org",
    "advisor_room": "316",
    "officers": "Arjun Chandrasekar, achandrasekar177, Co-President, oversees all club-wide tasks and leads meetings.\nKatelyn Chu, kchu067, Co-President, oversees all club-wide tasks and leads meetings.\nIshani Das, idas665, Vice President, handles finances and fundraising, assists with tasks and meetings.\nBella Wu, bwu117, Community Relations, works on getting partnerships for guest speakers and company tours.\nApoorva Gowda, agowda076, Community Relations, works on getting partnerships for guest speakers and\ncompany tours.\nAnnie Shang, ashang822, Public Relations, handles all media, advertisement, and photography.\nCaroline Cheng, ccheng411, Public Relations, handles all media, advertisement, and photography.\nEllie Yao, eyao928, Public Relations, handles all media, advertisement, and photography.\nBraden Monroe, bmonroe906, Competitions Officer, handles all logistics and preparation for our three\nconferences.\nWilliam Yao, wyao511, Competitions Officer, handles all logistics and preparation for our three conferences.\nIris Wang, iwang387, Competitions Officer, handles all logistics and preparation for our three conferences.\nMichael Feng, mfeng611, Partnership with Business Project Chair, leads one of our four projects, creates a\ncommittee, and possibly presents at the State Leadership Conference.\nDonggyu Lee, dlee177, Community Service Project Chair, leads one of our four projects, creates a committee,\nand possibly presents at the State Leadership Conference.\nPhani Chunduru, pchunduru464, Individual Projects Chair, leads one of our four projects, creates a committee,\nand possibly presents at the State Leadership Conference.\nSanskriti Jain, sjain940, American Enterprise Project Chair, leads one of our four projects, creates a committee,\nand possibly presents at the State Leadership Conference.",
    "adjustment_policy": "We will implement a 3-strike policy for all officers. If officers are late for meetings, don't respond in due time, or fail to adhere to our club guidelines, they will receive a strike for each action. After 1 strike, executive team will talk with the officer, after 2 strikes, both the executive team and Mr. Hill will talk with the officer, and after 3 strikes, the officer will be kicked out and replaced through a new application process.",
    "new_officer_application": "The new executive team will be selected through an application and interview-based process handled by the old executive team. Then, the new executive team will do the same for the new officer team."
}