{
    "name": "Interact",
    "email": "chsinteract12.5170@gmail.com",
    "category": "volunteering and honor societies",
    "meeting_time": "Every other Monday at lunch",
    "description": "",
    "affiliation": "Rotary District 5170 Foundation",
    "advisor_name": "Precious Bagamaspad",
    "advisor_email": "precious_bagamaspad@fuhsd.org",
    "advisor_room": "504",
    "officers": "Poojitha Panda, lpanda497, President, oversee officers progress in their roles and serve as the representative of\nCHS Interact\nAmit Rand, arand119, VP, assist President in their roles & meeting minutes\nDiya Kulkarni, dkulkarni227, Sec/Tres, Keep track of finances, help plan fundraisers, keep track of service hours\nand members\nAdhvika Parashuram, aparashuram116, Internal Events Coordinator, plan service activities for during meetings,\nhelp create forms to track service hours\nShivany Dowlat, sdowlat766, External Events Coordinator, plan service activities partnering with external\nnon-profit organizations for outside of meetings, help with forms for service hours\nHenry Widjaja, hwidjaja801, Community Project Chair, lead a committee of 8-10 students to plan service events\nmonthly and fundraiser towards the Community Project (announced annually at FLC by Rotary International\nD5170)\nAnchita Arora, aarora0962, Community Project Chair, see above\nShreya Shetty, sshetty015, International Project Chair, lead a committee of 8-10 students to plan service events\nmonthly and fundraiser towards the International Project (announced annually at FLC by Rotary International\nD5170)\nGrace Cho, gcho383, International Project Chair, see above",
    "adjustment_policy": "If an officer receives warnings for their behavior and still does not rectify their conduct, they will be removed from the officer team. If a fellow officer is able to take on their role, they will be asked to do so. If another officer cannot step in, a new officer will be selected through an application process or by selecting a member who has demonstrated dedication and leadership skills.",
    "new_officer_application": "The current executive team (VP and President) will release a two-fold application: written application and interviews due on a specific date with no late entries. Then, this year’s Exec team will choose the new President and VP through the application. The new Exec team will then choose the other officers based on the application. They will be the ones conducting interviews for the other officers."
}