{
    "name": "International Club",
    "email": "internationalclubofficers@gmail.com",
    "category": "culture & ethnicities",
    "meeting_time": "every other Friday at lunch in the CCC",
    "description": "",
    "affiliation": "NA",
    "advisor_name": "Gregg Buie",
    "advisor_email": "gregg_buie@fuhsd.org",
    "advisor_room": "office (Counselor)",
    "officers": "Reva Mahto, rmahto471, President, Organizes and leads the club, looks over and helps out on all officers work,\nreaches out to other club for collaborations and plans out all events\nDevansh Patel, dpatel680, Vice President, Helps the President organize the club, leads when the President is\nabsent, makes announcements, takes initiative to lead events\nKaren Yan, kyan188, Secretary, Takes notes during all officer meetings, communicates with advisors and other\nclubs, keeps up with email notifications, assists other officers when they need help\nSophie Hua, shua615, Treasurer, Keeps track of club expenses and reimburses money\nShaona Das, sdas463, Public Relations, Advertises events (ex: Thanksgiving, International Week), increases\nclub presence on school campus, designs and creates advertisements and posters, in charge of social media\nAngela Choi, dchoi389, ELD Lead, Communicates with ELD teachers about any needed ELD tutoring sessions\nand events, organizes ELD tutoring sessions\nRajanya Majumdar Biswas, rmajumdarbiswas620, Event Manager, If needed, works with PR to create and hang\nposters and flyers, helps set-up for event, helps create and set-up decorations, also takes initiative in leading\nevents\nEliana Aschheim, easchheim103, Commissioner, Helps set and clean up events, helps advertise by hanging\nflyers, etc , helps other officers when needed, helps recruit members\n*All officers are required to discuss event ideas & logistics together regardless of their position. *",
    "adjustment_policy": "We have a strike and warning system to keep officers in check and hold them accountable for misdemeanors and being tardy. If an officer is unable to meet their responsibilities, International Club will hold recruitments either to existing officers or interested students. We will follow the Handbook guidelines to ensure the club moves smoothly during possible transitions.",
    "new_officer_application": "We have a google sheet composed of all the contributions our current club officers make to International Club. The club will take this into consideration during applications. If the club has more people applying than the officer spots available, we may hold interviews to see who is best fit for the role. Otherwise, we will have a google form with written application questions. Their responses will be judged by officers that are seniors and our advisor. The club may also ask current officers and members about why they might recommend someone for a certain position."
}