{
    "name": "Key Club",
    "email": "Cupertinohskeyclub@gmail.com",
    "category": "volunteering & honor societies",
    "meeting_time": "Every other monday at lunch",
    "description": "",
    "affiliation": "Key Club International",
    "advisor_name": "Amanda Slowikowski",
    "advisor_email": "amanda_slowikowski@fuhsd.org",
    "advisor_room": "509",
    "officers": "Angelina Kondo, akondo799, President, Leads and facilitates officer and member meetings. Maintains contact with\nclub advisor and Kiwanis advisor. Creates meeting agendas and delegates tasks. Attends and represents\nCupertino Key Club in routinely ASB, division, district, and training meetings.\nSusan Chen, schen357, Vice President, Assists the President. Helps oversee the whole club along with the\nPresident. Manages officers to assure every individual is finishing their tasks. Provides assistance to other\nofficers. Represents and manages the club when the President is not available\nElle Yao, eyao928, Secretary, Updates the Membership Update Center (MUC) monthly and whenever new\nmembers join. Collaborates with the Treasurer to separate the non-paid members from the paid members. Fills out\nand submits Meeting Minutes to ASB monthly (through Google Classroom). Takes notes about what is said during\nofficer meetings. Creates attendance forms for member meetings\nLina Youn, lyoun439, Treasurer, Oversees financial responsibilities within the club. Provides ideas for and\nexecutes fundraisers. Fills out/picks up reimbursement forms with/from Ms. Nguyen at the ASB office. Completes\nand submits Treasurer Monthly Report Form's (tMRFs) by the 3rd of each month by 6 PM\nErin Cooney, ecooney512, Emily Kim, ekim467, Co-Project Chairs, Finds weekly service events for members to\nparticipate in. Contacts organizations to assure Cupertino Key Club’s attendance at each service event. Produces\nsign up sheets/forms and regulates service event details. Tracks all volunteering hours on a Google spreadsheet\nand shares to members. Adds events to member meeting slides\nAshley Tsai, atsai274, Ella Zheng, ezheng467, Co-Publicities, Creates digital and physical flyers to inform\nmembers about club-related events. Drafts captions and posts on social media platforms. Creates different ways\nto promote and advertise the club. Regularly updates the club website",
    "adjustment_policy": "In the case that officers fail to complete their duties, they will receive a warning and if they continue to disregard their tasks, they will be removed from their position. In the case of an empty position, it'll depend on which officer is removed. If it's a co-position, there will be no new officer but will receive help from the Vice President to complete their tasks. In the case that it's the Secretary is removed, the Treasurer or one of the co-chairs will take over. Same for in the case the Treasurer is removed. In the case the President is removed, the VP will take over & select a new VP from the remaining officer board. In the case the VP is removed, the Prez will select a new VP from the remaining officer board. Otherwise, there shall be no adjustments to officer roles and positions.",
    "new_officer_application": "New Officers will be selected next year through an application based system. Anyone wishing to apply must be a dues paid member, must fill out the google form application and finally go through an interview process. In the final decision making process, only the seniors/non-applicants will make the decision on who will be each officer based on their responses to our questions. The overall process will take around 3 weeks, one week for written applications, 1.5 weeks for interviews and half a week for the decisions."
}