{
    "name": "Latinx Student Union (LSU)",
    "email": "isuatchs@gmail.com",
    "category": "culture & ethnicities",
    "meeting_time": "Every other Thursday at lunch",
    "description": "",
    "affiliation": "N/A",
    "advisor_name": "Martiza Santa Cruz",
    "advisor_email": "maritza_santacruz@fuhsd.org",
    "advisor_room": "109",
    "officers": "Heidi Aguilar Loya, haguilarloya528, President: Create monthly agenda (officer meetings, club meetings, etc),\nFacilitate meetings, Check emails regularly, and Attend all ASB meetings\nSarah Huerta, shuerta900, Vice President: Be prepared to step in for president when president is not available ,\nWork with president to build schedules, Check emails regularly, and Submit announcement forms\nDiana Villalobos Gutierrez, dvillalobosgutie352, Secretary: Take minutes of each officer and member meeting\nand submit to google classroom assignment every month, Post Schoology announcements,Ensure that everyone\nhas filled out attendance form, and monitor media posts\nSwaney Alvarez Guerra, salvarezguerra112, Treasurer: Organize fundraisers\nMake deposits and submit reimbursement forms to ASB office, Maintain accounting of club balance, Calculate\nand authorize expenses, and Manage event expenses\nKatherine Dart, kdart807, Media manager: Design creative posts for meetings and events (member meetings,\nmember bondings, fundraisers etc.), Maintain club's social media (tiktok, instagram), and Promote club related\nactivities with the necessary information\nALL ROLES MUST:\nAttend officer and member meetings, Contribute to meeting slides, Generate ideas for events (bondings,\nfundraisers, etc), Communicate with other officers and advisor on a regular basis, and Provide support to other\nofficers when needed",
    "adjustment_policy": "We will notify all club officers, our advisor, and ASB clubs commissioners of the departing officer and fill the missing position by either recruiting a new member or have an already existing officer fulfill the duties in their place.",
    "new_officer_application": "Officers will create a form for members to apply and once the deadline has passed all officers and our advisor will meet to review all the applicants and hold interviews. After reviewing we will select the ones we believe are the best candidates for next year."
}