{
    "name": "Muslim Student Association",
    "email": "tinomsa23@gmail.com",
    "category": "culture & ethnicities",
    "meeting_time": "every friday at lunch",
    "description": "",
    "affiliation": "n/a",
    "advisor_name": "Madame Aggoun",
    "advisor_email": "imene_aggoun@fuhsd.org",
    "advisor_room": "6111",
    "officers": "Muhammed Abdalla, mabdalla391, President, role is to lead the club, initiate regular and emergency meetings (if\nnecessary), and discuss what will be said/posted on the club's ig account\nSaleh Elmahi, selmahi766, vice president, role is to assist the president in planning and executing events, watch\nover and send emails on behalf of the club, as well as fill in for president if something happens\nFareed Ahmed, fahmed616, treasurer, role is to maintain an accurate record of financial transactions (including\nreceipts) and keep accurate profit and loss statements (clearly detailing all money collected and spent and help\nclub keep accurate records)\nKhadijah Abdalla, kabdalla004, secretary, role is to create and maintain meeting agendas, take attendance at\nmeetings and keep permanent attendance records, maintain contact names, phone numbers, emails of club\nmembers, and keep copies of activity calendars and special events documents\nZoya Khan, Zkhan908, PR, role is to manage the club's social media account",
    "adjustment_policy": "When necessary, the clubs officers will be adjusted during the year by holding a group meeting and discussing (in detail) what needs to be change and who will be doing what. Everyone will be aware of and understand the changes made.",
    "new_officer_application": "Officers for next year will be selected after a couple of things occur. First, they have to fill out an application form where they will list what position they want, why they want it, why they are the best choice for this position, and they will determine whether or not their schedule gives them time to properly do their job. Next, they will have to conduct an interview with the current officers and the advisor of the club. After that, we will select the officer that best fits the position based on the information we collect."
}