{
    "name": "National Math Honor Society",
    "email": "tino.nmhs@gmail.com",
    "category": "stem & tech",
    "meeting_time": "every other Monday at lunch",
    "description": "",
    "affiliation": "Mu Alpha Theta",
    "advisor_name": "Amanda Slowikowski",
    "advisor_email": "amanda_slowikowski@fuhsd.org",
    "advisor_room": "509",
    "officers": "Samikshaa Natarajan, President, snatarajan614\nRole Description: Leads the club, manages communications between the advisor and ASB, presides over club\nand officer meetings, and guides other officers in their duties\nYatindran Dilip, Vice President, ydilip530\nRole Description: Manages the club email and communication with club members, and works with the secretary\nto present NMHS to the student body\nShyamak Singh, Vice President, ssinghO88\nRole Description: Works with the president to manage meetings and prepare agendas, and collaborates with the\ntreasurer to manage registration\nUpasana Puranik, Secretary, upuranik800\nRole Description: Creates meeting agendas, manages club attendance and other logistics, and presents NMHS\nto the student body through social media and announcements\nAlyssa Chen, Treasurer, achen332\nRole Description: Manages the club finances and works with the vice president regarding competition\nregistration and scholarship awards",
    "adjustment_policy": "When necessary, officers will be adjusted through direction of the president and vice presidents. If new officers need to be added, the president and vice presidents will determine duties for that new role and if it is really required, and will then present ideas to other officers for feedback and thoughts and hold a vote. If officers need to be removed, the president and vice presidents will convene and determine why the aforementioned officer has failed to complete duties, and will then speak with other officers to hold a vote and come to a conclusion. If officer roles need to be adjusted, the president and vice president will come up with a better role assignment for other officers and will then speak privately with the involved officers to put them in the best position possible.",
    "new_officer_application": "New officers for next year will be selected through an application process. First, club officers will determine what positions are available and if new roles need to be added. Then, all club members will be given a form to fill out their application for any available officer positions. The club officers will read each application fairly and will decide on whether or not the applicant should be an officer. If necessary, officers may conduct an interview with the applicant to better determine if they would be good officers for next year. Once the new officers are decided, they will be announced to the rest of the club and will begin to integrate with next year's officer team."
}