{
    "name": "National Chinese Honor Society",
    "email": "nchs2815@gmail.com",
    "category": "volunteering & honor societies",
    "meeting_time": "every other Wednesday at lunch",
    "description": "",
    "affiliation": "None.",
    "advisor_name": "Ying Jin",
    "advisor_email": "ying_jin@fuhsd.org",
    "advisor_room": "6101",
    "officers": "Anna Lee, alee200, President, leads the club, organizes member + officer meetings, and communicates with the\nadvisor.\nEvelyn Liao, eliao231, Vice President, communicating and searching for local organizations that can partner with\nus to provide members with volunteering opportunities(during lunch or after school).\nRanbir Jain, rjain012, Vice President, support the president with any promotion and communication with other\nteachers besides the advisor.\nKaylee Ng, kng626, Secretary, completes meeting minutes and organizes any forms.\nDarius Hsu, dhsu858, Treasurer, manages finance and transactions and plans for fundraisers.\nCatherine Xu, cxu476, Public Relations, will manage social media and email members of upcoming events and\nwill complete announcements whenever necessary.",
    "adjustment_policy": "Officers will be adjusted if they are unable to fulfill their position, constantly create an uncomfortable environment for others (through unfriendly comments, etc.), and/or for other reasons. After the advisor is notified and in agreement with the choice and the rest of the officers are aware, ASB will be notified immediately of this change (especially if the position that needs to be changed is one of the required positions). The officer being adjusted will be notified of the change with a private meeting with the advisor and the president with an explanation of why they are being adjusted. After that, we will recruit another person to take over the position within the given 2-week time frame. The club's constitution will also be altered and resubmitted.",
    "new_officer_application": "New officers will be selected when certain positions are empty. If a current officer would like to remain in their certain position, they will not need to reapply for the spot. Current officers are also able to leave the team if they desire. However, if the officer would like to change their position, they will notify the officer team and apply for that position (given it is vacant). The current executive team will find out the spots that can be applied for and allow anybody (the students at this school) the opportunity to apply for the empty positions. After the deadline and we have received a fair amount of responses, we will select the favorable candidate without any prejudice. They will then receive an email and join the team."
}