{
    "name": "Spanish Honor Society",
    "email": "cupertinoshh@gmail.com",
    "category": "volunteering & honor societies",
    "meeting_time": "every other Tuesday at lunch",
    "description": "",
    "affiliation": "American Association of Teachers of Spanish & Portuguese (AATSP)",
    "advisor_name": "Liza Aguilar",
    "advisor_email": "liza_aguilar@fuhsd.org",
    "advisor_room": "6110",
    "officers": "1. Elisha Myoung, emyoung486, President, lead the club and officer team by planning, initiating, and presiding\nover club and officer meetings; represent the club to ASB and Tino Student Body; communicate with the club\nadvisor; and keep track of officer relations and workload\n2. Minyu Huang, mhuang956, Vice President; watch the club email; communicate with the club advisor; assist\npresident in planning and executing meetings; and serve as president if the president becomes unable to fulfill her\nduties\n3. Saanvi Thummalapally, sthummalapally469, Secretary/Treasurer, maintain record of all meetings (agenda,\naction items, attendance), financial transactions and paperwork; plan fundraisers; keep copies of all important\ndocuments; and check club email\n4. Aalok Atre, aatre502, Competitions Coordinator, organize competitions (research and facilitate sign ups and\ndistribution of competition related material); prepare members for competitions by creating practice material and\ncommunicating information about competitions; focus on newly included competitions to the club\n5. Riya Karkhanis, rkarkhanis164, Public Relations, create promotional material; manage social media accounts;\nand create club designs (flyers, logos, and presentations)\n6. Nabeel Sonaseth, nsonaseth112, Competitions Coordinator, organize competitions (research and facilitate\nsign ups and distribution of competition related material); prepare members for competitions by creating practice\nmaterial and communicating information about competitions; focus on National Spanish Exam\n7. Erinn Huang, ehuang874, Community Service Liaison, keep track of member information and attendance;\nmanage tutorials for Spanish help; coordinate outside volunteer activities and collaborations with Spanish\nlanguage related organizations; and manage club discord server with PR\n8. Katie Kim, kkim049, Community Service Liaison, keep track of member information and attendance; manage\ntutorials for Spanish help; coordinate outside volunteer activities and collaborations with Spanish language related\norganizations; and manage club discord server with PR\n9. Olivia Mathai, omathai463, Event Coordinator, organize routine and major club bonding events/special\nactivities; design meeting slides with PR; and create supporting material used in member meetings",
    "adjustment_policy": "n the case that an officer is unable to fulfill their duties, they will either report themselves or be reported to the club advisor. If the officer is discharged under the decision of the advisor, their duties will either be taken up by their partner (if there is another officer with the same role) or their duties will be split amongst the other officers. If necessary an application will be opened to current members to fill officer positions. Specifics for roles that are not filled by two officers (except president and vice president): if the secretary/treasurer position is left vacant, one competitions coordinator will take up treasurer responsibilities and one community service liaison will take up secretary responsibilities. f the public relations position is left vacant, public relations responsibilities will be shared between community service liaisons and the event coordinator. f the event coordinator position is left vacant, event coordinating responsibilities will be distributed to community service liaisons. f the number of officers is not appropriate for the size of the club as the school year progresses, either applications will be opened to current members to add to the officer team or current officers with roles that are doubly filled will be asked to alternate in completing their responsibilities.",
    "new_officer_application": "Club executives (president and vice president) will be chosen by the current executives out of the current officer team with a combination of a written application and an interview. The candidates for the next year executives must take Spanish at Cupertino High School the next school year. After the future executives are selected, other club officers will be selected by them under the guidance of the current executives. As with the potential executives, potential officers must submit a written application about their interest in a certain officer position (which will be detailed by the future executives) and their qualifications. They will also be asked to have an interview (with or without the current executives). The candidates for the next year officers must take Spanish at Cupertino High School the next school year. All candidates must meet the requirements of club membership."
}