{
    "name": "Tino UNICEF",
    "email": "tinounicef@gmail.com",
    "category": "volunteering/service club",
    "meeting_time": "Every other Friday at lunch",
    "description": "",
    "affiliation": "UNICEF USA/Unite",
    "advisor_name": "Jenny Padgett",
    "advisor_email": "jenny_padgett@fuhsd.org",
    "advisor_room": "6222",
    "officers": "Ria Narang, rnarang420, President, Sets the agenda and plans meetings and events. The president works with\nthe club officers to accomplish the goals of the club.\nSona Kashyap, skashyap355, Vice President, Assists the president and sets up coordination\nViktor Maletin, vmaletin419, Internal Event Coordinator\nPlan/coordinate interactive and engaging activities for each member meeting\nEncourage club members to participate in Member-Driven Campaigns\nOrganize campus-wide awareness campaigns, awareness weeks, and help coordinate efforts\nIker Jimenez, iamoxjimenez064, External Event Coordinator\nPlan and execute regular (monthly/bimonthly) volunteer events\nMaintain member progress through a volunteer hour spreadsheet\nOrganize at least two guest speaker presentations throughout the course of the year, and maintain a good\nrelationship with outside organizations\nArohi Behara, abehara977, + Preethi Satish, psatish949, Outreach Coordinator\nRaise awareness of UNICEF’s mission and cause through working with a committee of 4-6 members\nPlan and execute outreach events with middle and elementary schools on a regular basis\nAssign tasks to members\nActively search for and plan potential awareness events\nShivany Dowlat, sdowlat766, Secretary/Treasurer\nTrack and log member attendance, and update member and officer meeting minutes\nNotify members of upcoming meetings\nPlan school fundraisers, and fill out all appropriate ASB forms\nSubmit school-wide announcements and manage reimbursements\nPriyanka Nappoly, pnappoly448, Public Relations\nCreate flyers, cover photos, profile pictures, overlays for promotion\nTake photos during meetings and events to be posted on Facebook and Instagram\nCreate promotional graphics to advertise member meetings, awareness events, and activitie:\naccounts",
    "adjustment_policy": "Officers will be required to come to mandatory officer meetings, where new ideas/events are brainstormed, assigned projects are updated, the status of said projects will be shared, and next steps are discussed.",
    "new_officer_application": "Officers are chosen on the basis on their past effort in the club, their feedback on the year's activities, and their plans for the incoming. Most individuals can point out obvious improvements needed for the club, but officer worthy} individuals point out more in-depth and specific fixes needed, and the next steps to go about changing them."
}