{
    "name": "Tino Science Club",
    "email": "tinoscienceclub@gmail.com",
    "category": "stem & tech",
    "meeting_time": "Every Tuesday at Lunch",
    "description": "",
    "affiliation": "N/A",
    "advisor_name": "Hugo Steemers",
    "advisor_email": "hugo_steemers@fuhsd.org",
    "advisor_room": "509",
    "officers": "Jimin Koo, jkoo555; Co-President\nOversee all club operations, lead officer team and plan member/officer meetings, manage ASB paperwork and\nforms, communicate with advisors and ASB for competitions/science fair\nRohan Tirumala, rtirumala396; Co-President\nOversee all club operations, lead officer team and plan member/officer meetings, manage ASB paperwork and\nforms, communicate with advisors and ASB for competitions/science fair\nSanika Patil, spatil581; Vice President\nManage registration for all Olympiads, coordinate with teachers to ensure notable results for Olympiads, science\nfairs, Science Bowl, and Science Olympiad, send out competition instruction emails and score report emails as\nnecessary, help oversee club operations, and check in with officers\nShweta Surendar, ssurendar173: Secretary/Treasurer\nHead/organize fundraisers, manage and maintain club budget, take meeting minutes during member and officer\nmeetings and submit to ASB, send out emails for meeting reminders/debriefs, maintain a spreadsheet of club\nmembers and email list\nChloe Chung, cchung415; Public Relations\nTake photos at club events and meetings, create promotional material as needed, manage club social media\naccounts, invite guest speakers to meetings, locate opportunities for club members\nAdhip Raghunathan, araghunathan612; Research Competition Officer\nExecute and update competitions curriculum for Synopsys\nAnagha Badriprasad, abadriprasad606; Research Competition Officer\nExecute and update competitions curriculum for Synopsys\nAaditya Karnataki, akarnataki027; Science Bowl Captain\nOrganize tryouts, coordinate with Mrs. Slowikowski for competitions and logistics, have a thorough\nunderstanding of Science Bowl rules, schedule and run practices, find resources and opportunities for team\nmembers, track individual performance and shuffle teams as necessary.\nEmily Tsai, etsai206; Science Olympiad Captain\nOrganize tryouts and event assignments, schedule and run study sessions, coordinate with Mrs. Solheim to\nregister for competitions, find resources and opportunities for team members.",
    "adjustment_policy": "If an officer fails to fulfill their responsibilities or is otherwise unable to serve, existing officers will split the added responsibilities until a new officer is selected. New responsibilities will be distributed based on the previous experience of the officers as well as the type of responsibility involved (financial, administrative, outreach, etc.)",
    "new_officer_application": "New officers will be selected in a two-step process. First, applicants will submit a google form describing their previous experience, the reason for applying, and their interest in the club. If applicants demonstrate that they are capable of serving the club and have a genuine interest, they will move on to the second round. Then, interviews will be held to decide between applicants accepted in the initial round."
}