{
    "name": "Tino Competitive Programming",
    "email": "chscompprogramming@gmail.com",
    "category": "stem & tech",
    "meeting_time": "every Friday at lunch",
    "description": "",
    "affiliation": "N/A",
    "advisor_name": "Ted Mcleod",
    "advisor_email": "ted_mcleod@fuhsd.org",
    "advisor_room": "314",
    "officers": "Aaron Cu, acu444, Co-President, lead the club and officer team, represent the club to ASB and the Tino Student\nBody, initiate and preside over meetings, plan and prepare agendas for meetings, serve as one of the mentors for\nsubgroups\nKatie Min, kmin509, Co-President, lead the club and officer team, represent the club to ASB and the Tino\nStudent Body, initiate and preside over meetings, plan and prepare agendas for meetings, serve as one of the\nmentors for subgroups\nJolie Han, jhan794, Vice President, watch the club email, assist the co-presidents in planning and execution,\nhelp promote the club through social media\nAakash Gokhale, agokhale664, Secretary/Treasurer, maintain a complete record of financial transactions, keep\naccurate profit and loss statements, fill out fundraiser paperwork, take attendance and meeting notes\nAlexander Du, adu557, Mentor, teach club members about competitive programming and answer\nprogramming-related questions they may have\nYeonwoo Son, yson225, Mentor, teach club members about competitive programming and answer\nprogramming-related questions they may have\nSneha Muppalla, smuppalla568, Mentor, teach club members about competitive programming and answer\nprogramming-related questions they may have",
    "adjustment_policy": "If an officer is not adequately fulfilling their duties, one of the co-presidents will direct message that officer in order to discover and solve the issue. The club advisor will also be notified and will step in if necessary. If an officer is unable to continue serving for the club, an officer-wide meeting will be held to discuss finding a replacement. The process of finding a replacement might involve temporarily opening up the officer application form, or, if there is a particular candidate who stands out, a different course of action may be taken. If the departing officer is one of the required positions, the ASB Clubs Commissioners will be notified and a replacement will be promptly found.",
    "new_officer_application": "New officers for next year will be selected through an application process involving two rounds. First, a google form will be sent out, providing an opportunity for applicants to describe their experience in competitive programming as well as in leadership. Then the submitted forms will be reviewed and a couple of potential officers will be interviewed, most likely through Zoom. This interview will include qualitative questions (more specific ones than the ones on the form) as well as a few programming exercises. The new officers will be determined based on the results of these interviews."
}