{
    "name": "Tino Explore (STEAM Magazine) Club",
    "email": "tinoexplore@gmail.com",
    "category": "stem & tech, student publication",
    "meeting_time": "weekly Tuesday lunch meetings",
    "description": "",
    "affiliation": "",
    "advisor_name": "Mrs. Amy Plat",
    "advisor_email": "amy_plat@fuhsd.org",
    "advisor_room": "7203",
    "officers": "Ashwika Agrawal, aagrawal264, President, Oversee all aspects of Tino Explore club management and processes\nNavyaa Gupta, ngupta914, Vice President, Oversee all aspects of Tino Explore club management and\nprocesses\nGrace Cho, gcho383, Cecilia Huang, chuang386, Administrative Assistants, Submits meeting minute forms to\nASB, Submits other important forms to ASB, Handles funds, receipt transactions, reimbursements, fundraisers\nMaisha Gupta, Mgupta767, Shreyas Gosakan, sshriramgosakan072, Arnav Gupta, agupta764, Community\nRelations, Updating club website and social media, finds guest speakers and arranges external opportunities such\nas company tours\nSerene Kim, skim055, Carrie Chen, cchen759, Public Relations, designs promotional material, takes photos at\nclub events, markets new issues\nRishik Buneti, rbuneti114, Sarthaki Agrawal, sagrawal875, Clarabelle Wang, cwang300, Karen Yan, kyan188,\nContent Managers, oversees topics covered in each issue, fact-checks and proofreads issues before publication",
    "adjustment_policy": "We have created a 3-strike policy within our club, which states that any officers who fail to meet their responsibilities (such as missing meetings and deadlines without prior notice) will be removed from the officer team upon 3 incidents.",
    "new_officer_application": "We have a thorough officer application process - the first step is a written application regarding prior involvement and specific experience pertaining to Tino Explore, general STEM and leadership experience, and qualifications for preferred positions. We then select a number of applicants for interviews, which are conducted via Zoom. Finally, we review our notes on each officer and release decisions."
}