{
    "name": "Tino Photography Club",
    "email": "photographyclub.tino@gmail.com",
    "category": "hobbies & interests",
    "meeting_time": "every other Monday at lunch",
    "description": "",
    "affiliation": "N/A",
    "advisor_name": "Jennifer Lowe-Weiler",
    "advisor_email": "jennifer_lowe@fuhsd.org",
    "advisor_room": "203",
    "officers": "1. Navyaa Gupta, ngupta914, President, The President should oversee all aspects of the club including meetings,\nfundraisers, and school/external photography events. They should maintain relations with the officer team, and\nwork closely with all officers to ensure that the club is running smoothly. The President is responsible for creating\nand executing curriculum and meetings throughout the year. Additionally, the President should maintain relations\nand communication with the club advisor.\n2. Maisha Gupta, mgupta767, Vice President, The Vice President should help the President oversee all aspects\nof the club, including meetings, fundraisers, and school/external photography events. They, along with the\nPresident, are responsible for suggesting a curriculum for the club to follow throughout the year. They should also\nconsistently come up with suggestions/ideas for improving the club and delegate the other officers to carry them\nout.\n3. Daniella Rand, drand821, Secretary, The Secretary should maintain relations between our club and ASB. This\ninvolves filling out our Clubs Constitution/Semester Planner at the beginning of the year & beginning of second\nsemester, and recording meeting minutes at officer meetings and general meetings. The Secretary should also be\nable to help other officers with miscellaneous tasks if they need it.\n4. Janvi Prasad, jprasad489, Treasurer, The Treasurer should manage our club’s money. This includes\nmonitoring our Club bank account, leading fundraisers to raise money for our club, purchasing items for our club\nwith the money we have, and getting reimbursed from ASB for outside expenses.\n5. Wendy Chung, schung120, PR Manager, The PR manager should ensure our club has a large presence on\ncampus. This is achieved by promoting our club both in person & on social media through posters, flyers, and\npromo pictures online. The PR manager will also have to manage our Instagram page and ensure that we post\nregularly. APR manager should have strong photography and graphic design skills.\n6. Shreyas Shriram Gosakan, sshriramgosakan072, PR Manager, same as above (5)",
    "adjustment_policy": "If officers can no longer serve their position for their club or consistently fail to fulfill their officer responsibilities, they will either be replaced by a new officer or existing officer. If an existing officer is able to take up their responsibilities, their role will be changed to accommodate for the responsibilities of their old position and the position that needs to be filled. If an existing officer cannot take up the responsibilities of the open role, an application will be created for finding a new officer. This application process will be very similar to how officers are selected for the following year.",
    "new_officer_application": "Towards the second half of the second semester of the school year, the current President will appoint a junior or sophomore who is currently on the officer team as President for the following school year. The current President will also create an application using google forms. The application will ask for the applicant's interest in the club and in photography. The application will also ask officers to submit some of their photography work. There will also be questions that are role-specific that will ask why the applicant is fit for the specific role they are applying for. Other than the application form, other criteria for selecting officers will include the applicant's commitment to and attendance with the club as a regular member."
}