{
    "name": "Tino Psychology",
    "email": "tinopsychology@gmail.com",
    "category": "interest club",
    "meeting_time": "Biweekly Fridays during lunch",
    "description": "",
    "affiliation": "n/a",
    "advisor_name": "Mr. Jacobs",
    "advisor_email": "zach_jacobs@fuhsd.org",
    "advisor_room": "6228",
    "officers": "Aishwarya Aswin, aaswin244, President, Lead the officer team, Coordinate with advisor, responsible for\ncorrespondence with ASB (submit forms), make sure all rules/policies are met, organize club calendar/meetings\nMeghana Vinjamury, mvinjamury082, Vice President, Oversee all aspects of Tino Psychology club management\nand processes, Assist in creation of meeting agendas for all meetings, Mediate any conflicts within officer team,\nEnsure that all officers are present for meetings and fulfilling their duties, Coordination with teacher advisor and\nASB if necessary\nNavya Tiwari, ntiwari244, Secretary, Submits meeting minute forms to ASB, Keeps track of member information\nand meeting tracker, Records club and officer meetings\nEvan Lu, elu362, Treasurer, Handles all funds/receipt transactions, Deals with reimbursements and ASB, Must\ncome up with and run at least one fundraiser the following year, Submit announcement form to ASB prior to\nmeetings\nCatherine Cho, ccho391, PR, Promotes the club and events through advertising (flyers, announcements, etc),\nTake photos at club events and meetings, Help with member retention and recruiting new members through\nadvertisement, Send emails to club members in a timely manner(Meeting Reminders/Debrief)\nFelicia Deshon, fdeshon508, PR, Promotes the club and events through advertising (flyers, announcements,\netc), Take photos at club events and meetings, Help with member retention and recruiting new members through\nadvertisement, Send emails to club members in a timely manner(Meeting Reminders/Debrief)",
    "adjustment_policy": "If an officer needs to be adjusted, we will first share the responsibilities of the officer among existing officers, then decide as a club with our club advisor and ASB if we need to add a new officer in place of them.",
    "new_officer_application": "Through an application and interview process with current officers."
}