{
    "name": "Tino Tri-M Music Honor Society",
    "email": "tinomusicclub@gmail.com",
    "category": "volunteering&honor societies",
    "meeting_time": "every Thursday at Lunch",
    "description": "",
    "affiliation": "NAFME, Tri-M",
    "advisor_name": "Ben Scharf",
    "advisor_email": "ben_scharf@fuhsd.org",
    "advisor_room": "rm 702",
    "officers": "Jimin Koo, jkoo555, President, Work with teacher advisor to coordinate meeting logistics, work with officers to\nplan events and performances. Lead club officer team. Communicate with the school/clubs to make sure all\nliability/release forms are signed.\nFrances Kueper, fkueper859, Vice-President, Oversee general club operations as well as officer and member\ninvolvement. Work closely with the president, teacher advisor, and ASB to plan for meetings, auditions,\nrehearsals, and performances.\nPriyanka Nappoly, pnappoly448, Secretary and Treasurer, Manage club funds and budget for instruments and\nother materials. Keep track of money raised from fundraisers and/or donations. Record meeting minutes and send\nthem to ASB.\nNatalie Chen, nchen286, Public Relations, Manage TMC’s email and social media accounts and promote TMC.\non campus. Send out forms, event reminders, and other information by email and social media. Responsible for\noutreach and tracking member involvement throughout the school year.\nHenry Widjaja, hwidjaja801, Event Manager, Work with president, teacher advisor, the school, and outside\norganizations to organize in-school performances. Reach out to senior centers for performances. Keep track of\nliability/release forms and volunteering hours for club members.",
    "adjustment_policy": "If an officer fails to fulfill their responsibilities or is otherwise unable to serve, existing officers will split the added responsibilities until a new officer is selected. New responsibilities will be distributed based on the previous experience of the officers as well as the type of responsibility involved (financial, administrative, outreach, etc.)",
    "new_officer_application": "New officers will be selected in a two-step process. First, applicants will submit a google form describing their previous experience, the reason for applying, and their interest in the club. If applicants demonstrate that they are capable of serving the club and have a genuine interest in the club, they will move on to the second round. Here, interviews will be held to decide between applicants accepted in the initial round."
}