{
    "name": "Tino Octagon",
    "email": "tinooctagon@gmail.com",
    "category": "volunteering & honor societies",
    "meeting_time": "Tuesday Bi-Weekly at lunch",
    "description": "",
    "affiliation": "Junior Optimist Octagon International",
    "advisor_name": "Kelleen Loo",
    "advisor_email": "kelleen_loo@fuhsd.org",
    "advisor_room": "6232",
    "officers": "1. Poornasai Vura, pvura055, President, responsible for overseeing operations, leading the club, creating agendas\nfor meetings, and coordinating with all officers and members\n2. Anish Shamarao, ashamarao556, Vice President, responsible for coordinating meetings, assisting President\nwith leading club activities, and proactively sending emails to members and organizations\n3. Karen Yan, kyan188, Secretary, responsible for administrative processes amongst the club, completing\nmonthly meeting minutes, inputting # of volunteer hours into a master spreadsheet, and managing emails\n4. Anav Saxena, asaxena954, Treasurer, responsible for conducting fundraisers and activities throughout the\nyear, overseeing aspects of club apparel, preparing budgets, and collecting membership dues\n5. Aarav Khunger, akhunger081, Event Manager, responsible for finding events online, providing them to all\nmembers in a timely and organized manner, and clarifying member questions regarding the events\n6. Sashank lyer, siyer865, Event Manager, responsible for finding events online, providing them to all members\nin a timely and organized manner, and clarifying member questions regarding the events\n7. Riya Malik, rmalik881, Public Relations, responsible for publicizing club with graphics through social media,\ndeveloping outreach methods, developing relationships with other organizations, inviting guest speakers, and\nphotographing the events\n8. Prashant Kondayapalepu, pkondayapalepu093, Public Relations, responsible for publicizing club with graphics\nthrough social media, developing outreach methods, developing relationships with other organizations, inviting\nguest speakers, and photographing the events",
    "adjustment_policy": "There may be cases throughout the year in which certain officers are not being dutiful and are not fulfilling their expectations. In such cases, the President and Vice President will communicate with the advisor to give said officer a warning. If they disregard the warning and continue to slack off, they will be removed from the officer team. On the flip side, we might be in need of additional officers during the year if there seems to be an unbalanced member:officer ratio. If this happens to be the case, the current officers will collaborate on making a mid-year officer application for anybody interested. The responses will be reviewed and an interview may be held before accepting a new officer into our team.",
    "new_officer_application": "In regards to the selection process for next year's officers, our current President, VP, and Secretary will collaborate} on creating an officer application with questions ranging from leadership experience to visions for the club. Interested members can apply to their desired position. After the submissions have been locked, the President, Vice President, and advisor will read through the responses and make a final decision regarding the new officer team. If two members seem equally qualified / interested in a particular position, we will hold interviews with both of them before making a final decision. If we do not recieve satisfactory responses for a specific position, a member who applied to another role may be selected. For example, if there are no treasurer applications that see to fit our standards, we may choose an individual who applied for secretary."
}