{
    "name": "Tinovation",
    "email": "tinovationofficerteam@gmail.com",
    "category": "stem & tech",
    "meeting_time": "every Monday at lunch",
    "description": "",
    "affiliation": "N/A",
    "advisor_name": "Eric Ferrante",
    "advisor_email": "eric_ferrante@fuhsd.org",
    "advisor_room": "307",
    "officers": "Shourik Banerjee, sbanerjee370, Co-President, Lead the club and officer team and primary communicator\nbetween club and advisor\nNeil Deo, ndeo997, Co-President, Lead the club and officer team\nShyamak Singh, ssingh088, Vice President, Assists the presidents with their duties\nJiaming Liu, jliu281, VP of Administration [Secretary and Treasurer], Manages all the writing for the club\n(including scripts for morning announcements) and manages club finances\nRyan Kim, rkim097, Web Lead, Co-leads the web sub-team and teaches members of his subteam how to\ndevelop web applications\nTaisei Delacruz, tdelacruz480, Web Lead, Co-leads the web sub=team and teaches members of his subteam\nhow to develop web applications\nDaniel Cui, dcui826, Python Lead, Co-leads the python sub-team and teaches members of his subteam server\ndevelopment and machine learning aspects of python\nBhargav Eranki, beranki539, Python Lead, Co-leads the python sub-team and teaches members of his subteam\ndevelopment and machine learning aspects of python\nArnav Gupta, agupta764, Public Relations, Handles the graphics for club announcements, manages the social\nmedias for the club, and assists secretary with scripts for morning announcements\nDhruv Kandula, dkandula358, Cybersecurity Lead, Co-leads the cybersecurity sub-team and prepares members\nfor the cybersecurity competitions\nAayush Goel, agoel978, Cybersecurity Lead, Co-leads the cybersecurity sub-team and prepares members for\nthe cybersecurity competitions\nShiama Srikantan, ssrikantan255, Mobile Lead, Leads the mobile sub-team and teaches members how to build",
    "adjustment_policy": "1. The Executive officers will discuss the situation and reach a conclusion on how to adjust the officer team 2. Then, the Executive officers will notify the club advisor of their conclusion. The club advisor may approve or reject the exec's conclusion. 3. If approved, the exec will carry out the officer adjustment. If not approved, the exec will repeat steps 1 and 2 until the advisor approves the adjustment.",
    "new_officer_application": "Tinovation 2022-23 executive members will select the next group of Tinovation executives through interviews and google form applications. Then, the rest of the officers will be selected by the new Tinovation executives (Tinovation 2023-24 executive team) based on a google form application and interviews. All officer selections will be approved by the club advisor, Mr. Ferrante."
}