{
    "name": "Tino Investors",
    "email": "tinoinvestors@gmail.com",
    "category": "business & politics",
    "meeting_time": "Every Wednesdays at lunch",
    "description": "",
    "affiliation": "Not Applicable",
    "advisor_name": "Blair Liquigan-Pador",
    "advisor_email": "biair_liquigan-pador@fuhsd.org",
    "advisor_room": "204",
    "officers": "Yatindran Dilip, ydilip530, President, ensures the club functions smoothly and overlooks important aspects such\nas keeping membership high. Communicates with the advisor for important issues and initiates group meetings\nwhen necessary. Helps create slide presentations and presents them. Also communicates with other officers to\ndistribute tasks and provides input on important topics. Occasionally hosts group meeting to discuss important\ntopics with other club officers over zoom.\nApoorva Gowda, agowda076, Vice President, communicates with President to ensure the club functions\nsmoothly. Helps overlook other officer members roles, helps create slide presentations, and presents them. Meets\nwith President to help work on tasks such as creating the Club Constitution or making important decisions.\nNote: The treasurer, secretary, PR are equal in ranking/succession.\nMichael Feng, mfeng611, Treasurer, helps create slides and presents them to the club. Also handles the\nprocesses of money with ASB, and communicates any issues/information to the rest of the club. In addition, helps\ncontribute to important topics such as increasing member participation and performs tasks to ensure the club\nfunctions smoothly.\nWilliam Yao, wyao511, Secretary, helps create slides and presents them to the club. Also responsible for\ncreating Google Forms (for attendance/other links), taking notes of meeting minutes, and using input from forms to\nfigure out how to improve the club. Also sends emails/messages on discord about reminders to attend the club.\nAmitabh Gulati,agulati760, Public Relations, helps create slides and present them to the club. Also creates\nmarketing content to promote the club to a wider audience by creating graphics, filling out the announcements,\nand managing the social medias accounts.",
    "adjustment_policy": "Officers will adjust throughout the year as necessary. If the club has a lower participation rate, or the number of members start to decline, officers will commit a lot more time to ensure that the club increases in popularity. Additionally, whenever there are issues relating to the club (increasing participation, or making meetings more engaging), officers will attend a zoom meeting to add input and make changes to future meetings. Furthermore, officers will go above and beyond in their roles by being ahead on tasks or putting the club in the announcements. Issues will be addressed in a formal, neat manner with all officers adjusting to fix the issue. The President and Vice President will regularly communicate with all the officers to ensure that everyone fulfills their responsibility and stays committed in their positions.",
    "new_officer_application": "The officer selection process will begin in early April. New officers will be selected from a variety of different factors. One factor is attendance, as members should show that they are involved and committed to the club. The next factor is the written application. This application would show the potential officers qualities and how they would add to our club. Lastly we would have officer interviews. During the interviews, we would go deeper into their written application by asking them questions about what they wrote. This way, we would be able to gain a better understanding of who they are. After accounting for all of these factors, the officer team will meet up and decide which members are best fit to be officers in the next school year."
}