{
    "name": "Tino Girls Who Code",
    "email": "tinogirlswhocode@gmail.com",
    "category": "stem & tech",
    "meeting_time": "every Thursday at lunch",
    "description": "",
    "affiliation": "Girls Who Code",
    "advisor_name": "Ted Mcleod",
    "advisor_email": "ted_mcleod@fuhsd.org",
    "advisor_room": "314",
    "officers": "Aashna Shimkhada, ashimkhada323, President, lead the club/officers, organize meetings, fill out forms, create a\nsupportive/welcoming environment, work on weekly slides, look for guest speakers\nUpasana Puranik, upuranik800, Vice President, manage officers, help organize meetings, create a\nsupportive/welcoming environment, work on weekly slides, look for guest speakers\nKoena Gupta, kgupta744, Secretary / Project Lead, plan projects, events, officer bindings, create a\nsupportive/welcoming environment, work on weekly slides, look for guest speakers\nSanika Patil, spatil581, Treasurer, manage funds and plan ways to raise money, create a supportive/welcoming\nenvironment, work on weekly slides, look for guest speakers\nNandika Kohli, nkohli085, Public Relations, make promotional media, post on club socials, fill out\nannouncements form, create a supportive/welcoming environment, work on weekly slides, look for guest speakers",
    "adjustment_policy": "If officer adjustments need to be made and a new officer is to be selected, we will follow the method for new officer(s) mentioned in the next section. If officer adjustments need to be made within the existing officer team, all officers will meet up and discuss what is/is not working in terms of roles/duties and collectively think of solutions which we will then implement.",
    "new_officer_application": "All officers will work to create a Google Form for interested club members to fill out. Once the deadline to fill out the form passes, all officers will meet and discuss each submission and who seems to be the best fit to become an officer for the club. Interviews will be held if necessary. When the officers come to a consensus, individuals who applied will be sent emails with updates on their applications."
}