{
    "name": "Tino Art Club",
    "email": "tinoartclub@gmail.com",
    "category": "hobbies & interests",
    "meeting_time": "every Wednesday at lunch",
    "description": "",
    "affiliation": "n/a",
    "advisor_name": "Amber Steele",
    "advisor_email": "amber_steele@fuhsd.org",
    "advisor_room": "815",
    "officers": "Celina Yang: cyang508, President, Lead the club and the club officer team, Represent the club to ASB and the\nTino Student Body, Initiate and preside over club officer and member meetings, Call special meetings, if\nnecessary, Contact and coordinate with other clubs for collaborations, Contact and coordinate with club advisor\nNatalie Chen: nchen286, Co-Vice President, Collaborate with president and other officers, If and when\nnecessary, should be able to perform all of president's duties, Help make announcements (work with president),\nHelp president with introductions to weekly activities, Support members during meetings, Keep track of time at\nmeetings and make sure we are on schedule, help create examples for projects, Contact and coordinate with club\nadvisor\nSoha Roy: sroy498, Co-Vice President, Collaborate with president and other officers, If and when necessary,\nshould be able to perform all of president's duties, Help make announcements (work with president), Help\npresident with introductions to weekly activities, Support members during meetings, Keep track of time at\nmeetings and make sure we are on schedule, Help create examples for projects, Contact and coordinate with club\nadvisor\nVishnave Jay: vjayO69, Treasurer, Maintain a complete and accurate record of all financial transactions,\nincluding receipts and disbursements, Keep accurate profit and loss statements, clearly detailing all money\ncollected and spent, and help the club keep accurate records, Fill out fundraiser paperwork, Purchase materials\nfor projects\nGina Kim: gkim083, Secretary, Create and maintain meeting agendas, Take attendance at meetings and keep\npermanent attendance records. Maintain contact names and email addresses of club members, Keep copies of\nactivity calendars and special events documents, Send out weekly meeting reminder emails, Regularly check\nclubs email account and reply to emails\nSarina Nemati: snemati624, Public Relations, Manage club social media accounts, Create posts and graphics to\npromote the club, Manage morning announcements, Check & coordinate with Club advisor regarding promotional\nmaterial",
    "adjustment_policy": "If any officers are unable to fulfill their role, their responsibility may be split between the other officers.",
    "new_officer_application": "Chosen by the current officer team & next year's club president. New officers will be chosen through a first written application and then another round of interviews if deemed necessary."
}