{
    "name": "Tino Student Doctors",
    "email": "tinostudentdoctorsclub@gmail.com",
    "category": "stem and tech",
    "meeting_time": "twice a month, thursdays, at lunch",
    "description": "",
    "affiliation": "N/A",
    "advisor_name": "Daniel Stavis",
    "advisor_email": "daniel_stavis@fuhsd.org",
    "advisor_room": "7201",
    "officers": "President: Neha Gutlapalli\n- ngutlapalli227\n- Make sure the club is running smoothly, manage the club, keep in contact with the adviser, make sure all ideas\nand plans are given the go-ahead by said adviser\nVice President: Emily Park\n- spark862\n- Help the President with their role, help manage the club, help other officers adapt to their roles, fill in for\npresident if president is unavailable\nSecretary: Aruja Gupta\n- agupta765\n- Take appropriate meeting notes, take note of necessary mementos for both member and officer meetings,send\nout reminder emails for club events, meetings, fundraisers to members,sending out and replying to emails,\nmentioning important details and events during member meetings\nTreasurer: Daniel Yousefi\n-dyousefi531\n- Report funds monthly to secretary and other officers,consistently plan and execute fundraisers throughout the\nyear — one per semester, coordinate Clubs Days and events, work with other officers to finish meeting slides, fill\nout necessary forms\nPublic Relations: Nandika Kohli\n- nkohli085\n- Possible future design apparel,design Promo for meetings, fundraisers, important events, etc.,maintain\nInstagram posts & stories and other forms of promotion, collaborate with other officers to host and promote\nevents, such as Clubs Food Day or events alongside other clubs and ASB\nCommunity relations: Kartikeya Pidaparthi\n-kpidaparthi765\n- Contact guest speakers, reach out via email, social media, etc. through the club official domains, inform\npresident of guest speakers and available timings, immediately inform the president if any cancellations or\nchanges in schedule happen",
    "adjustment_policy": "If an officer cannot keep up with their responsibilities, the first remedy is to have an existing officer take over the position. If no officers are available to take over the position, then we will allow members to sign up for the position if they are interested in being a part of the officer team.",
    "new_officer_application": "The officer selection process for the year will be based on two factors. The first is a form in which we will ask questions about the club and the positions they are applying for. The second will be an interview held by the current President and Vice president."
}