{
    "name": "Tino Film Club",
    "email": "tinofilmclub@gmail.com",
    "category": "hobbies & interests",
    "meeting_time": "Every other Friday at Lunch",
    "description": "",
    "affiliation": "None",
    "advisor_name": "Stacey Morse",
    "advisor_email": "stacey_morse@fuhsd.org",
    "advisor_room": "6217",
    "officers": "Rohan Shah: rshah028, President\n- As president of the Tino Film Club, my responsibilities are to communicate to ASB, watch over and plan our\nclub meetings (whether they be officer or public), and be there for any special circumstances. | plan to create\nmeeting agendas and slides (with the help of the VP) before the meeting, and work on our material to make sure\nwe achieve our goals for this year.\nKrish Garg: kgarg682, Vice President\n- As the Vice President my job is to help the president, Check the club email, be the main person that relays\ninformation between club advisor and club officers, and fill in for the president when/if needed. Specifically I'll be\nemailing Mrs. Morse if there are any changes or if we need to notify her of anything, and I'll aide Rohan in the\ncreation of the slides and meeting plan.\nDarius Hsu: dhsu858, Treasurer\n- | will keep a record of all financial transactions. This means tracking our profit/loss/etc. and where our money\ngoes. | will also fill out any fundraiser paperwork and get the bank number from ASB when it's needed.\nJemu Lee: jlee216, Secretary\n- My job is to create, record club meeting and keep the attendance records and gather all the contact names\nsuch as names, address , phone numbers and email of club members. Lastly, keep the copies of events or club\nactivities. Make sure the meeting minutes are submitted at the end of each month.\nCatherine Xu: cxu476, Publicity Manager\n- My job is to work with the other officers to create promotional material for the club, mostly the Instagram posts.\nI'll be in charge at taking photos at events and managing the club social media accounts.",
    "adjustment_policy": "If an officer must leave, they will notify the club and ASB immediately so the club can find a suitable replacement within 2 weeks. If an officer is not their doing their job then any officer can report them to the advisor who can then issue a warning or fire them from the club. Most likely they will be issued 1 warning, and then be fired if they continue. After, we have 6 weeks to find a suitable replacement.",
    "new_officer_application": "For the next year, the officers will be selected by applications. The roles will probably go to people with experience in the field, or who have been a part of the club. After the applications are submitted they will be reviewed by the current officer team and the positions will be chosen."
}