{
    "name": "Women's Empowerment Association",
    "email": "cupertinowea@gmail.com",
    "category": "other (activist society)",
    "meeting_time": "Every other Friday at Lunch",
    "description": "",
    "affiliation": "N/A",
    "advisor_name": "Nikki Merrick",
    "advisor_email": "nikki_merrick@fuhsd.org",
    "advisor_room": "104",
    "officers": "Lisa Zivanic, Izivanic921, President, The President provides the vision and leadership to enable the club to\nachieve its goals of cultivating a safe space on campus for those who support feminism and gender equality. The\nPresident is responsible for officer accountability including leading all officer and member meetings, and\ncommunicating with Ms. Merrick, our club advisor.\nAnika Rao, arao868, Vice President, The Vice President supports the Presidents in all aspects, and carries out\nthe Presidents’ duties when the President is unavailable. The Vice President works alongside the President in a\ndual role to ensure the club runs efficiently.\nPreethi Sukumar, psukumar762, Secretary and Treasurer, The SecTreas is responsible for coordinating\nfundraising activities as well as completing the monthly meeting minutes. The SecTreas also ensures that the club\nhas enough funds for each of its endeavors and evaluates the expenditure of such funds when appropriate.\nMegha Basaralu, mbasaralu171, Community Liaison, The Community Liaison Officer organizes community\nevents such as the Womens March, and finds means for members to serve the community and participate in civic\nengagement through those events. Outside of the presidents, this officer will be the point of contact for club\ncollaborations.\nFelicia Deshon, fdeshon508, Senior Graphic Designer, The senior graphic designer publicizes WEA activities\nand meetings, in addition to creating infographics intended for the school and local community. The senior graphic\ndesigner is also in charge of mentoring the Junior Graphic Designer.\nHrishita Das, hdas472, Media Director, The media director is in charge of creating, managing, and creating\ndigital content for the club website, as well as creating graphics in collaboration with the graphic designers.\nLara Gupta, Igupta613, Junior Graphic Designer, The junior graphic designer publicizes WEA activities and\nmeetings, in addition to creating infographics intended for the school and local community.",
    "adjustment_policy": "WEA will be continuing a policy implemented during the previous school year, the policy entails that three officer strikes result in being removed from the officer team. Not completing a task on time twice, without communicating with the executive team first, will result in an officer strike. If this occurs one more time after the first strike, it will result in an additional strike. Extensions can be granted but communication is key. However, any strikes at all will reflect poorly when performance evaluations are conducted at the end of the year to decide any new position, since positions are not guaranteed for the following year. In the instance that an officer is removed, | will follow the same protocol as last year, when one of the PR officers chose to leave the officer team during first semester. | would open an application for that position as soon as possible, while following our standard two-step process.",
    "new_officer_application": "New officers will be selected through a two-step application process. First, the President and VP will review the written application that is submitted via Google Form. After the applications have been thoroughly evaluated, cuts will be made, and the President & VP will conduct interviews with the remaining candidates. The final decision will be made collaboratively between the President and VP, taking into consideration the candidates’ written application, interview, and meeting attendance throughout the year."
}